nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/drivers/fsl_power.c
status_t POWER_ConfigRegulatorSetpoints(power_regulator_t regulator,
                                        const power_regulator_voltage_t *volt,
                                        const power_lvd_voltage_t *lvd)
{
    status_t ret = kStatus_Success;

#if defined(PMC0)
    if (regulator == kRegulator_DCDC) /* DCDC with 2 setpoints. */
    {
        if ((volt->DCDC.vsel1 < volt->DCDC.vsel0) || (lvd->VDDN.lvl1 < lvd->VDDN.lvl0) ||
            (volt->DCDC.vsel1 > 1150000U) || (volt->DCDC.vsel0 < 500000U))
        {
            ret = kStatus_InvalidArgument;
        }
        else
        {
            PMC->DCDCVSEL = PMC_DCDCVSEL_VSEL0(POWER_CalRegValueFromVolt(volt->DCDC.vsel0, 500000U, 6250U)) |
                            PMC_DCDCVSEL_VSEL1(POWER_CalRegValueFromVolt(volt->DCDC.vsel1, 500000U, 6250U));
            PMC->LVDVDDNCTRL = PMC_LVDVDDNCTRL_LVL0(POWER_CalRegValueFromVolt(lvd->VDDN.lvl0, 500000U, 10000U)) |
                               PMC_LVDVDDNCTRL_LVL1(POWER_CalRegValueFromVolt(lvd->VDDN.lvl1, 500000U, 10000U));
        }
    }
#else
    if (regulator != kRegulator_Vdd1LDO) /* Only VDD1 LDO configurable from Sense side. */
    {
        ret = kStatus_InvalidArgument;
    }
#endif   /* PMC0, only compute domain support DCDC, LDO VDD2 control. */
    else /* LDO with 4 setpoints. */
    {
        if ((volt->LDO.vsel3 < volt->LDO.vsel2) || (volt->LDO.vsel2 < volt->LDO.vsel1) ||
            (volt->LDO.vsel1 < volt->LDO.vsel0) || (lvd->VDD12.lvl3 < lvd->VDD12.lvl2) ||
            (lvd->VDD12.lvl2 < lvd->VDD12.lvl1) || (lvd->VDD12.lvl1 < lvd->VDD12.lvl0) ||
            (volt->LDO.vsel3 > 1150000U) || (volt->LDO.vsel0 < 450000U))
        {
            ret = kStatus_InvalidArgument;
        }
        else
        {
            PMC_REG(0x24U + 4U * ((uint32_t)regulator - 1U)) =
                PMC_LDOVDD1VSEL_VSEL0(POWER_CalRegValueFromVolt(volt->LDO.vsel0, 450000U, 12500U)) |
                PMC_LDOVDD1VSEL_VSEL1(POWER_CalRegValueFromVolt(volt->LDO.vsel1, 450000U, 12500U)) |
                PMC_LDOVDD1VSEL_VSEL2(POWER_CalRegValueFromVolt(volt->LDO.vsel2, 450000U, 12500U)) |
                PMC_LDOVDD1VSEL_VSEL3(POWER_CalRegValueFromVolt(volt->LDO.vsel3, 450000U, 12500U)); /* LDOVDDxVSEL */
            PMC_REG(0x30U + 4U * ((uint32_t)regulator - 1U)) =
                PMC_LVDVDD1CTRL_LVL0(POWER_CalRegValueFromVolt(lvd->VDD12.lvl0, 500000U, 10000U)) |
                PMC_LVDVDD1CTRL_LVL1(POWER_CalRegValueFromVolt(lvd->VDD12.lvl1, 500000U, 10000U)) |
                PMC_LVDVDD1CTRL_LVL2(POWER_CalRegValueFromVolt(lvd->VDD12.lvl2, 500000U, 10000U)) |
                PMC_LVDVDD1CTRL_LVL3(POWER_CalRegValueFromVolt(lvd->VDD12.lvl3, 500000U, 10000U)); /* LVDVDDxCTRL */
        }
    }

    return ret;
}

status_t POWER_ConfigLvdSetpoints(power_regulator_t regulator, const power_lvd_voltage_t *lvd)
{
    status_t ret = kStatus_Success;

#if defined(PMC0)
    if (regulator == kRegulator_DCDC) /* DCDC with 2 setpoints. */
    {
        if ((lvd->VDDN.lvl1 < lvd->VDDN.lvl0) || (lvd->VDDN.lvl0 < 500000U))
        {
            ret = kStatus_InvalidArgument;
        }
        else
        {
            PMC->LVDVDDNCTRL = PMC_LVDVDDNCTRL_LVL0(POWER_CalRegValueFromVolt(lvd->VDDN.lvl0, 500000U, 10000U)) |
                               PMC_LVDVDDNCTRL_LVL1(POWER_CalRegValueFromVolt(lvd->VDDN.lvl1, 500000U, 10000U));
        }
    }
#else
    if (regulator != kRegulator_Vdd1LDO) /* Only VDD1 LDO configurable from Sense side. */
    {
        ret = kStatus_InvalidArgument;
    }
#endif   /* PMC0, only compute domain support DCDC, LDO VDD2 control. */
    else /* LDO with 4 setpoints. */
    {
        if ((lvd->VDD12.lvl3 < lvd->VDD12.lvl2) || (lvd->VDD12.lvl2 < lvd->VDD12.lvl1) ||
            (lvd->VDD12.lvl1 < lvd->VDD12.lvl0) || (lvd->VDD12.lvl0 < 500000U))
        {
            ret = kStatus_InvalidArgument;
        }
        else
        {
            PMC_REG(0x30U + 4U * ((uint32_t)regulator - 1U)) =
                PMC_LVDVDD1CTRL_LVL0(POWER_CalRegValueFromVolt(lvd->VDD12.lvl0, 500000U, 10000U)) |
                PMC_LVDVDD1CTRL_LVL1(POWER_CalRegValueFromVolt(lvd->VDD12.lvl1, 500000U, 10000U)) |
                PMC_LVDVDD1CTRL_LVL2(POWER_CalRegValueFromVolt(lvd->VDD12.lvl2, 500000U, 10000U)) |
                PMC_LVDVDD1CTRL_LVL3(POWER_CalRegValueFromVolt(lvd->VDD12.lvl3, 500000U, 10000U)); /* LVDVDDxCTRL */
        }
    }

    return ret;
}

void POWER_GetLvdSetpoints(power_regulator_t regulator, power_lvd_voltage_t *lvd)
{
    uint32_t reg = 0U;

    (void)memset(lvd, 0, sizeof(power_lvd_voltage_t));

    if (regulator == kRegulator_DCDC) /* DCDC with 2 setpoints. */
    {
        reg = PMC->LVDVDDNCTRL;
        lvd->lvl[0] =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDDNCTRL_LVL0_MASK) >> PMC_LVDVDDNCTRL_LVL0_SHIFT);
        lvd->lvl[1] =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDDNCTRL_LVL1_MASK) >> PMC_LVDVDDNCTRL_LVL1_SHIFT);
    }
    else /* LDO with 4 setpoints. */
    {
        reg = PMC_REG(0x30U + 4U * ((uint32_t)regulator - 1U));

        lvd->VDD12.lvl0 =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDD2CTRL_LVL0_MASK) >> PMC_LVDVDD2CTRL_LVL0_SHIFT);
        lvd->VDD12.lvl1 =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDD2CTRL_LVL1_MASK) >> PMC_LVDVDD2CTRL_LVL1_SHIFT);
        lvd->VDD12.lvl2 =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDD2CTRL_LVL2_MASK) >> PMC_LVDVDD2CTRL_LVL2_SHIFT);
        lvd->VDD12.lvl3 =
            POWER_CALCULATE_LVD_VOLT_FROM_VALUE((reg & PMC_LVDVDD2CTRL_LVL3_MASK) >> PMC_LVDVDD2CTRL_LVL3_SHIFT);
    }
}

void POWER_SelectRunSetpoint(power_regulator_t regulator, uint32_t setpoint)
{
    if (regulator == kRegulator_DCDC)
    {
        assert(setpoint < 2U);
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_DCDC_VSEL_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_DCDC_VSEL(setpoint);
    }
    else if (regulator == kRegulator_Vdd2LDO)
    {
        assert(setpoint < 4U);
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_LDO2_VSEL_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_LDO2_VSEL(setpoint);
    }
    else
    {
        assert(setpoint < 4U);
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_LDO1_VSEL_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_LDO1_VSEL(setpoint);
    }
}

void POWER_SelectSleepSetpoint(power_regulator_t regulator, uint32_t setpoint)
{
    if (regulator == kRegulator_DCDC)
    {
        assert(setpoint < 2U);
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_DCDC_VSEL_MASK;
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_DCDC_VSEL(setpoint);
    }
    else if (regulator == kRegulator_Vdd2LDO)
    {
        assert(setpoint < 4U);
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_LDO2_VSEL_MASK;
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_LDO2_VSEL(setpoint);
    }
    else
    {
        assert(setpoint < 4U);
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_LDO1_VSEL_MASK;
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_LDO1_VSEL(setpoint);
    }
}

void POWER_SetRunRegulatorMode(power_regulator_t regulator, uint32_t mode)
{
    if (regulator == kRegulator_DCDC)
    {
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_DCDC_LP_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_DCDC_LP(mode);
    }
    else if (regulator == kRegulator_Vdd2LDO)
    {
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_LDO2_MODE_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_LDO2_MODE(mode);
    }
    else
    {
        PMC->PDRUNCFG0 &= ~PMC_PDRUNCFG0_LDO1_MODE_MASK;
        PMC->PDRUNCFG0 |= PMC_PDRUNCFG0_LDO1_MODE(mode);
    }
}

