nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/drivers/fsl_power.c
        SLEEPCON0->PRIVATE_CCTRL0 |= PRIVATE_CONTROLLER_HWWAKE_MODULE_MASK;
        SLEEPCON0->SHA_MED_TCTRL0 |= SLEEPCON0_SHA_MED_TCTRL0_FLEXIO_B_LPREQ_MASK |
                                     SLEEPCON0_SHA_MED_TCTRL0_LPSPI16_B_LPREQ_MASK |
                                     SLEEPCON0_SHA_MED_TCTRL0_LPSPI14_B_LPREQ_MASK; /* FLEXIO, LPSPI Bus*/
        SLEEPCON0->SHA_SEN_TCTRL0 |= SLEEPCON0_SHA_SEN_TCTRL0_MICFIL_STOP_MASK;     /* MICFIL */
        SLEEPCON0->PRIVATE_TCTRL0 |= PRIVATE_TCTRL_HWWAKE_MODULE_MASK0;             /* LP_FLEXCOMM */
        SLEEPCON0->PRIVATE_TCTRL2 |= PRIVATE_TCTRL_HWWAKE_MODULE_MASK1;             /* SAI */

        while ((SLEEPCON0->PRIVATE_CSTAT0 & PRIVATE_CONTROLLER_HWWAKE_MODULE_MASK) !=
               PRIVATE_CONTROLLER_HWWAKE_MODULE_MASK)
        {
        }
        while ((SLEEPCON0->SHA_MEDSEN_TSTAT0 & SHA_MEDSEN_TSTAT_HWWAKE_MODULE_MASK) !=
               SHA_MEDSEN_TSTAT_HWWAKE_MODULE_MASK)
        {
        }
        while ((SLEEPCON0->PRIVATE_TSTAT0 & PRIVATE_TSTAT_HWWAKE_MODULE_MASK0) != PRIVATE_TSTAT_HWWAKE_MODULE_MASK0)
        {
        }
        while ((SLEEPCON0->PRIVATE_TSTAT1 & PRIVATE_TSTAT_HWWAKE_MODULE_MASK1) != PRIVATE_TSTAT_HWWAKE_MODULE_MASK1)
        {
        }

        CLKCTL0->PSCCTL1  = lpReqClockCfg;
        RSTCTL0->PRSTCTL2 = lpReqResetCfg;
    }
}

AT_QUICKACCESS_SECTION_CODE(static void POWER_DMA_HWWake_LPRestore(void))
{
    if (SLEEPCON0->HW_WAKE != 0U) /* DMA HW_WAKE enabled. */
    {
        /* restore the configuration */
        SLEEPCON0->PRIVATE_CCTRL0 = lpReqConfig[0];
        SLEEPCON0->SHA_MED_TCTRL0 = lpReqConfig[1];
        SLEEPCON0->SHA_SEN_TCTRL0 = lpReqConfig[2];
        SLEEPCON0->PRIVATE_TCTRL0 = lpReqConfig[3];
        SLEEPCON0->PRIVATE_TCTRL2 = lpReqConfig[4];
    }
}

AT_QUICKACCESS_SECTION_CODE(static void POWER_DisableCache(XCACHE_Type *base))
{
    /* First, push any modified contents. */
    base->CCR |= XCACHE_CCR_PUSHW0_MASK | XCACHE_CCR_PUSHW1_MASK | XCACHE_CCR_GO_MASK;

    /* Wait until the cache command completes. */
    while ((base->CCR & XCACHE_CCR_GO_MASK) != 0x00U)
    {
    }

    /* As a precaution clear the bits to avoid inadvertently re-running this command. */
    base->CCR &= ~(XCACHE_CCR_PUSHW0_MASK | XCACHE_CCR_PUSHW1_MASK);

    /* Now disable the cache. */
    base->CCR &= ~XCACHE_CCR_ENCACHE_MASK;
}

AT_QUICKACCESS_SECTION_CODE(static void POWER_EnableCache(XCACHE_Type *base))
{
    /* Invalidate all lines in both ways and initiate the cache command. */
    base->CCR |= XCACHE_CCR_INVW0_MASK | XCACHE_CCR_INVW1_MASK | XCACHE_CCR_GO_MASK;

    /* Wait until the cache command completes. */
    while ((base->CCR & XCACHE_CCR_GO_MASK) != 0x00U)
    {
    }

    /* Now enable the cache. */
    base->CCR |= XCACHE_CCR_ENCACHE_MASK;
    __ISB();
    __DSB();
}

/** @brief This API configure the SLEEPCON SLEEPCFG and PMC_PDSLEEPCFG registers.
 *
 * @param exclude_from_pd the bits mask need to be cleared for the registers.
 */
AT_QUICKACCESS_SECTION_CODE(static void POWER_EnterLowPower_FullConfig(const uint32_t exclude_from_pd[7],
                                                                       power_mode_cfg_t mode,
                                                                       uint32_t pmic_mode_pins))
{
    uint32_t pmc_ctrl;
    uint32_t pmicMode;
    uint32_t pdsleepcfg0;
    bool cacheEnabled[2];
    bool backupCache[2];

    uint32_t pmsk = __get_PRIMASK();

    __disable_irq();

    /* Body bias is configured through other APIs before the API call. */

    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

    if (mode == kPower_DeepSleep)
    {
        /* The DMA HWWake function requires all the ACK of modules supporting HWWake, do handshake for those modules. */
        POWER_DMA_HWWake_LPRequest();
    }

    /* Power on mask bit correspond modules during Deep Sleep mode. */
    SLEEPCON->SLEEPCFG = (SCFG0_DEEP_SLEEP & ~exclude_from_pd[0]) | (SLEEPCON->RUNCFG & ~exclude_from_pd[0]);

    if ((exclude_from_pd[0] & SLEEPCON0_SLEEPCFG_FRO0_PD_MASK) == 0U) /* Power down FRO0, need wait FRO0 power down. */
    {
        SLEEPCON->PWRDOWN_WAIT &= ~SLEEPCON0_PWRDOWN_WAIT_IGN_FRO0PDR_MASK;
    }
    if ((exclude_from_pd[0] & SLEEPCON0_SLEEPCFG_FRO1_PD_MASK) ==
        0U) /* When keeping power on, the PWRDOWN_WAIT is not used. */
    {
        SLEEPCON->PWRDOWN_WAIT &= ~SLEEPCON0_PWRDOWN_WAIT_IGN_FRO1PDR_MASK;
    }

    pdsleepcfg0    = PMC->PDSLEEPCFG0 & (~PCFG0_DEEP_SLEEP);
    backupCache[0] = false;
    backupCache[1] = false;

    switch (mode)
    {
        case kPower_DeepSleep:
            if ((exclude_from_pd[5] & PMC_PDSLEEPCFG4_CPU0_CCACHE_MASK) == 0U)
            {
                backupCache[1] = true;
            }
            if ((exclude_from_pd[5] & PMC_PDSLEEPCFG4_CPU0_SCACHE_MASK) == 0U)
            {
                backupCache[0] = true;
            }

            /* Keep *BB, LDOVSEL, DCDV VSEL bits not changed. Clear DPD, FDPD, FDSR, V2COMP_DSR, V2COM_DSR(When
             * V2COM_DSR set all other VDD2 need to be off), PMICMODE bits. */
            pdsleepcfg0 &=
                ~(PMC_PDSLEEPCFG0_FDSR_MASK | PMC_PDSLEEPCFG0_V2COMP_DSR_MASK | PMC_PDSLEEPCFG0_V2COM_DSR_MASK |
                  PMC_PDSLEEPCFG0_DPD_MASK | PMC_PDSLEEPCFG0_FDPD_MASK | PMC_PDSLEEPCFG0_PMICMODE_MASK);
            PMC->PDSLEEPCFG0 = pdsleepcfg0 | (PCFG0_DEEP_SLEEP & ~exclude_from_pd[1]);
            /* V2NMED_DSR should be set if VNCOM_DSR is set. */
            if ((PMC->PDSLEEPCFG0 & PMC_PDSLEEPCFG0_VNCOM_DSR_MASK) != 0U)
            {
                assert((exclude_from_pd[1] & PMC_PDSLEEPCFG0_V2NMED_DSR_MASK) == 0U);
            }
            break;

        case kPower_DeepSleepRetention:
            backupCache[0] = true;
            backupCache[1] = true;
            /* Keep *BB, LDOVSEL, DCDV VSEL bits not changed. Clear DPD, FDPD, PMICMODE bits. Always set
             * V2COMP_DSR(Compute DSR) and V2DSP_PD(When VDD2_COMP off, VDD2_DSP need to be off).*/
            pdsleepcfg0 &= ~(PMC_PDSLEEPCFG0_DPD_MASK | PMC_PDSLEEPCFG0_FDPD_MASK | PMC_PDSLEEPCFG0_PMICMODE_MASK);
            PMC->PDSLEEPCFG0 = pdsleepcfg0 |
                               ((PCFG0_DEEP_SLEEP | PCFG0_DSR | PMC_PDSLEEPCFG0_FDSR_MASK) & ~exclude_from_pd[1]) |
                               PMC_PDSLEEPCFG0_V2COMP_DSR_MASK | PMC_PDSLEEPCFG0_V2DSP_PD_MASK;
            /* Check DSR combination. If request V2COM_DSR,all other DSR bits should be set */
            if ((PMC->PDSLEEPCFG0 & PMC_PDSLEEPCFG0_V2COM_DSR_MASK) != 0U)
            {
                assert((exclude_from_pd[1] & (PMC_PDSLEEPCFG0_V2COMP_DSR_MASK | PMC_PDSLEEPCFG0_V2NMED_DSR_MASK |
                                              PMC_PDSLEEPCFG0_VNCOM_DSR_MASK)) == 0U);
            }
            else if ((PMC->PDSLEEPCFG0 & PMC_PDSLEEPCFG0_VNCOM_DSR_MASK) !=
                     0U) /* V2NMED_DSR should be set if VNCOM_DSR is set. */
            {
                assert((exclude_from_pd[1] & PMC_PDSLEEPCFG0_V2NMED_DSR_MASK) == 0U);
            }
            else
            {
                /* Empty. */
            }
            break;

        case kPower_DeepPowerDown:
            /* Incase the CPU is in DSR mode. */
            backupCache[0] = true;
            backupCache[1] = true;
            /* Keep *BB, LDOVSEL, DCDV VSEL bits not changed. Clear PMICMODE bits.*/
            pdsleepcfg0 &= ~(PMC_PDSLEEPCFG0_PMICMODE_MASK | PMC_PDSLEEPCFG0_FDSR_MASK);
            PMC->PDSLEEPCFG0 =
                pdsleepcfg0 | ((PCFG0_DEEP_SLEEP | PCFG0_DSR) & ~exclude_from_pd[1]) | PMC_PDSLEEPCFG0_DPD_MASK;
            break;

        case kPower_FullDeepPowerDown:
            /* Incase the CPU is in DSR mode. */
            backupCache[0] = true;
            backupCache[1] = true;
            /* Keep *BB, LDOVSEL, DCDV VSEL bits not changed. Clear PMICMODE bits.*/
            pdsleepcfg0 &= ~(PMC_PDSLEEPCFG0_PMICMODE_MASK | PMC_PDSLEEPCFG0_FDSR_MASK);
            PMC->PDSLEEPCFG0 =
                pdsleepcfg0 | ((PCFG0_DEEP_SLEEP | PCFG0_DSR) & ~exclude_from_pd[1]) | PMC_PDSLEEPCFG0_FDPD_MASK;
            break;

        default:
            /* Added comments to prevent the violation of MISRA C-2012 rule. */
            break;
    }

    pmicMode = (exclude_from_pd[1] & PMC_PDSLEEPCFG0_PMICMODE_MASK) >> PMC_PDSLEEPCFG0_PMICMODE_SHIFT;
    if (pmicMode == 0U) /* Use default PMIC Mode configuration. */
    {
        /* Set PMIC mode pin as pre-defined. */
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_PMICMODE(pmic_mode_pins);
    }
    else /* User defined PMIC mode. */
    {
        PMC->PDSLEEPCFG0 |= pmicMode << PMC_PDSLEEPCFG0_PMICMODE_SHIFT;
    }

    /* Regulator related configuration. */
    PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_LDO1_VSEL_MASK; /* Select lowest LDOVDD1 voltage for aggregation. */
    if (s_vdd1Src == kVddSrc_PMIC)
    {
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_LDO1_MODE_MASK; /* Bypass mode. */
    }
    else
    {
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_LDO1_MODE_MASK; /* Low power mode. */
    }
    if (s_vdd2Src == kVddSrc_PMIC)
    {
        PMC->PDSLEEPCFG0 &= ~PMC_PDSLEEPCFG0_LDO2_MODE_MASK; /* Bypass mode. */
    }
    else
    {
        PMC->PDSLEEPCFG0 |= PMC_PDSLEEPCFG0_LDO2_MODE_MASK; /* Low power mode. */
    }

